// phase 2 Adult :
//   Symptoms of attention-deficit;
//  التعليمات :
// "يجب ان تكون الاعراض في مرحلة البلوغ من 12 ل 5 سنين لمده اشهر علي الاقل لكي ينسب احد اعراض فرط الحركه و قلة الانتباه ان يكون مزمن مثل السمنه و ليس عرضي "

import 'quiz_model.dart';

List<Question> getQuestionsPhaseTwoAdult() {
  List<Question> list = [];
  list.add(Question(
    'A1.1'
    '\n'
    " هل تفشل في كثير من الاحيان في ايلاء اهتمام وثيق بالتفاصيل , او هل ترتكب اخطاء غير مبالية في عملك او اثناء انشطه اخري ؟ و كيف كان  ذلك خلال الطفولة؟"
    '\n'
    ": أمثلة خلال مرحلة البلوغ"
    '\n'
    "يخطئ نتيج إهماله"
    '\n'
    "  تعمل ببطء لتجنب الأخطاء"
    '\n'
    " لا تقرأ التعليمات بعنايه "
    '\n'
    "تعاني من صعوبة العمل بطريقه مفصله"
    '\n'
    "يلزمك الكثير من الوقت لاكمال المهام التفصيليه"
    '\n'
    "يتعثر بسهوله ف العمل الذى يحتوي علي العديد من التفاصيل"
    '\n'
    "يعمل بسرعه كبيرة، وبالتالي يرتكب العديد من الاخطاء",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    'A1.2'
    '\n'
    ": أمثلة خلال مرحلة الطفولة"
    '\n'
    "بسبب اهماله يخطئ في العمل المدرسي ❑"
    '\n'
    "الاخطاءالتي يرتكبها نتيجة عدم قراءة بشكل صحيح ❑"
    '\n'
    "يترك  الأسئل  دون إجابة بسبب عدم قراءتها بشكل صحيح ❑"
    '\n'
    "يترك الجانب الآخر لورقة الاختبار دون اجابه ❑"
    '\n'
    "يعلق الآخرون على عمله الذى لا يهتم به ❑"
    '\n'
    " عدم التحقق من الاجابات في الواجب المنزلي ❑"
    '\n'
    "الكثير من الوقت اللازم لاكمال المهام التفصيليه ❑",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    "A2.1"
    '\n'
    " هل تجد صعوبة في الحفاظ ومواصلة انتباهك في المهام؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    ": أمثلة خلال مرحلة البلوغ"
    '\n'
    "❑ غير قادر على مواصلة الانتباه بالمهام لفترة طويل"
    '\n'
    "❑ يشتتت انتباهه بسرع من تفكيره أو التداعيات"
    '\n'
    "❑ يجد صعوبه في مشاهدة فيلم حتى النهايه أو حتى قراءة كتاب"
    '\n'
    "❑ يصبح ملول بشكل سريع "
    '\n'
    "❑ يسأل ويعيد الأسئل حول الموضوعات التي تم مناقشتها بالفعل أمامه. ",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
      "A2.2"
      '\n'
      ": أمثلة خلال مرحلة الطفولة"
      '\n'
      "❑ صعوبه في مواصلة االنتباه بالمهام المدرسيه"
      '\n'
      "❑ صعوبه في مواصلة النتباه في اللعب "
      '\n'
      "❑ يشتت بسرعه"
      '\n'
      "❑ صعوبه في التركيز "
      '\n'
      "❑ بحاجه إلى ان بذل المجهود لتتجنب أن يصرف انتباهك "
      '\n'
      "❑ يمل بسرعه من الأنشطه المدرسيه",
      [
        Answer("نعم", 1),
        Answer(" لا", 0),
      ]));

  list.add(Question(
    "A3.1"
    '\n'
    "هل يبدو في كثير من الاحيان كم لو كنت لا تستمع عندم يتم التحدث إليك مباشرة؟ وكيف كان ذلك خلال الطفوله؟"
    '\n'
    ": أمثلة خلال مرحلة البلوغ"
    '\n'
    "❑  صعوبة التركيز على المحادثه بعد ذلك، لا تعرف ماذا كانت المحادثه"
    '\n'
    "❑ حالم أو مشغول"
    '\n'
    "❑ يقول الآخرون عنك أن أفكارك في مكان اخر ",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "A3.2"
    '\n'
    ": أمثلة خلال مرحلة الطفولة"
    '\n'
    " ❑ عدم معرفة ما قاله الآباء أو المعلمون "
    '\n'
    " ❑ حالم أو مشغول "
    '\n'
    "❑ الانصات فقط أثناء اتصال العين أو عند رفع الصوت"
    '\n'
    "❑ في كثير من الأحيان الحاجة إلى مخاطبتة مرةأخرى"
    '\n'
    "❑ الأسئله عند توجيهها يجب أن تتكرر ",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    "A4.1"
    '\n'
    "هل تفشل في كثير من الأحيان في اتباع التعليمات وفي إنهاء مهامك المهنية أو تفشل في الوفاء ب اللتزامات في العمل و كيف كان ذلك خلال مرحلة الطفولة (عند أداء الواجب المدرسي في مقابل العمل في المدرسه) ؟"
    '\n'
    ": أمثلة خلال مرحلة البلوغ"
    '\n'
    "❑ هل تختلط أو تتداخل المهام مع بعضها، فلا تنتهي من انجازها"
    '\n'
    "❑ صعوبة إكمال المهام بمجرد أن ينتهي الشعور بالجده "
    '\n'
    "❑تحتاج لمهله زمنيه لاكمال المهام "
    '\n'
    "❑ صعوبة في إكمال المهام الادارية"
    '\n'
    "❑ من الصعب اتباع التعليمات",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
      "A4.2"
      '\n'
      ": أمثلة خلال مرحلة الطفولة"
      '\n'
      "❑ صعوبة اتبام التعليمات"
      '\n'
      "❑ صعوبة اتباع التعليمات التي تتضمن أكثر من خطوة واحدة."
      '\n'
      "❑ عدم انجاز المهام"
      '\n'
      "❑ عدم إكمال الواجب المنزلي أو تسليمه"
      '\n'
      "❑تحتاج إلى المجهود المضاعف  من أجل إكما المهام ",
      [
        Answer("نعم", 1),
        Answer(" لا", 0),
      ]));

  list.add(Question(
    "A5.1"
    '\n'
    "هل تجد صعوبة في تنظيم المهام والألنشطة في كثير من الأحيان؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خالل مرحلة البلوغ:"
    '\n'
    "❑ صعوبة تخطيط أنشطه الحياة اليومي "
    '\n'
    "❑منزلك أو مكان شغلك الاثنين غير منظمين"
    '\n'
    "❑ تخطيط للقيام بالعدد من المهام معا او التخطيط الغير الفعال لأداء المهام"
    '\n'
    "❑حجز حاجات كتير ف نفس الوقت بتشتت"
    '\n'
    "❑ دائم التأخير"
    '\n'
    "❑  To Do List غير قادر على استخدام جدول أعمال أو مذكرات باستمرار"
    '\n'
    "❑ التصلب وعدم المرونه بسبب الحاجه للحفاظ على الجداول زمنيه ثابته يعني مش قادر يعمل حاجه و دايما حاسس انو عطلان "
    '\n'
    "❑ فقر الشعور بالوقت"
    '\n'
    "❑ينشيء جداول ولكن لا يستخدمها "
    '\n'
    "❑ بحاجه إلى أشخاص آخرين لاتمام الأشياء",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "A5.2"
    '\n'
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "❑ صعوبه في أن يكون جاهز ومستعد في الوقت المحدد"
    '\n'
    "❑ غرفته غير مرتبه"
    '\n'
    "❑ من الصعب أن يلعب بمفرده"
    '\n'
    "❑ صعوبة التخطيط لأداء الواجب المنزلي"
    '\n'
    "❑ أداء المهام بطريقه مشوشة"
    '\n'
    "❑ دائم الوصول متأخرا"
    '\n'
    "❑ فقر الشعور بالزمن"
    '\n'
    "❑ صعوبة الحفاظ على نفسه/ تسلية أو الترفيه عن نفسها ",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    "A6.1"
    '\n'
    "هل تتجنب في كثير من الأحيان )أو هل لديك نفور من أو أنك لا ترغب في القيام به( المهام التي تتطلب جهدا عقليا مستمرا؟ وكيف كان ذلك خلال الطفولة؟ "
    '\n'
    ":أمثلة خلال مرحلة البلوغ"
    '\n'
    "أقوم بأسهل أو أخف المهام في المقام الأول"
    '\n'
    "في كثير من الأحيان تؤجل المهام لأنها ممله أو صعبه"
    '\n'
    "❑تأجيل المهام بحيص  يتم تفويت مواعدها النهائية"
    '\n'
    "❑بتتجب العمل الروتيني، زي الأعمال الاداريه "
    '\n'
    "❑ لا تحب القراءة بسبب الجهد العقلي"
    '\n'
    "❑ تجنب المهام التي تتطلب الكثير من التركيز",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "A6.2"
    '\n'
    "مثلة خلال مرحلة الطفولة:"
    '\n'
    "❑تجنب الواجبات المنزليه لكرهها"
    '\n'
    "❑ لا يقرأ بعض الكتب أو لا يحب القراءة بسبب الجهد العقلي"
    '\n'
    "❑ تجنب المهام التي تتطلب الكثير من التركيز"
    '\n'
    "❑ النفور من المواد الدراسيه التي تتطلب الكثير من التركيز"
    '\n'
    "غالبا ما يؤجل المهام الممله أو الصعبه",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    " A7.1  "
    '\n'
    "هل غالبا ما تفقد الشياء المطلوبة للمهام أو الأنشطة؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خالل مرحلة البلوغ: "
    '\n'
    "❑ بتنسي المحفظة أو المفاتيح أو جدول العمال TO Do List"
    '\n'
    "❑ كثيرا تترك المهام وراءه"
    '\n'
    "❑ تفقد أوراق العمل"
    '\n'
    "❑ بتضيع الكثير من الوقت في التدوير او البحث عن الأشياء"
    '\n'
    "❑ بيتوتر لو لقا ناس كتير حوليه"
    '\n'
    "❑بيشيل الحاجات ف مكان و مش بيفتكر مكانها فين",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "A7.2"
    '\n'
    "امثله خلال مرحلة الطفوله"
    '\n'
    "❑ بيضيع حاجته زي القلم الرصاص و الأدوات بس بشكل متكرر"
    '\n'
    "❑ يقضي الكثير من الوقت في البحث عن الأشياء"
    '\n'
    "❑ بيتوتر لو لقا ناس كتير حوليه"
    '\n'
    "❑ المدرسين لاحظو كمان ان الطفل بيضيع حاجته",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    "  A8.1 "
    '\n'
    "هل بتتأثر كتير بالمشتتات الخارجيه؟ وده كان ازاي في مرحلةالطفولة؟"
    '\n'
    "لو في مشتت صعب جدا انك تركز"
    '\n'
    "حتي بعد ما ترجع تركز صعب توصل لنفس النقطه تاني نقطة البدايه"
    '\n'
    "بتتشتت من اقل حاجه"
    '\n'
    "بردو لو في محادثه بين شخص و شخص بيتشتت",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "A8.2"
    '\n'
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "في الفصل بتبص بره كتير و بتتشتت بسرعه و من اقل كلام و حتي لو رجعت تركز بيبقا صعب انك تمسك الخيط من الأول",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    "  A9 "
    '\n'
    "هل غالبا ما تنسى خلال الأنشطة اليومية؟ وكيف كان ذلك خلال الطفولة؟ "
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    " بتنسا المواعيد دايما او الالتزمات و بتحتاج للتذكير متكرر للمواعيد"
    '\n'
    "ممكن ترجع البيت علشان تجيب الحاجات المهمه و ده بيحصل بشكل متكرر"
    '\n'
    "حتي لو عامل جدول بتتأكد منو كتير"
    '\n'
    "أمثلة خلال مرحلة الطفولة: "
    '\n'
    "بتنسا تاخد حاجات المدرسه ف النص حاجه مهمه بتنسا انت كنت بتعمل ايه اصلا ولازم حد بفكرك بالحاجه كتير",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

// Total number of criteria Attention Deficit  / 9 (Present during adulthood)
// Total number of criteria Attention Deficit  / 9 (Present during childhood)

  list.add(Question(
    " part 2  فرط النشاط و الاندفاع"
    '\n'
    "B1.1"
    '\n'
    "هل تقوم في كثير من الأحيان بتحريك يديك أو قدميك بطريقة مضطربة أو هل تململ في مقعدك في كثير من الأحيان؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "صعوبه في الجلوس"
    '\n'
    "ممكن تفضل تلعب بالقلم و متفضلش ساكت"
    '\n'
    "ممكن كمان بيقضم ضوافره طول ما هو قاعد"
    '\n'
    "حاسس دايما بتوتر",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "  B1.2 "
    '\n'
    "امثلة خلال مرحلة الطفولة:"
    '\n'
    "في تعليقات ملحوظه من الأهل علي الحركه الزياده"
    '\n'
    "صعوبه في الجلوس"
    '\n'
    "ممكن تفضل تلعب بالقلم و متفضلش ساكت"
    '\n'
    "ممكن كمان بيقضم ضوافره طول ما هو قاعد"
    '\n'
    "حاسس دايما بتوتر",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    "  B2.1 "
    '\n'
    "هل تقف غالبا في المواقف التي يتوقع فيها أن تظل في مقعدك؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ  "
    '\n'
    "بتتجنب المحاضرات و اماكن التجمع"
    '\n'
    "مش بتقعد فتره طويله ويتتحرك دايما و تفضل انك تتجول بدل الجلوس ",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B2.2  "
    '\n'
    "مثلة خلال مرحلة الطفولة:"
    '\n'
    "واقف ف وقت الأكل او في الفصل"
    '\n'
    "عندو صعوبه جامده في الجلوس سواء في المدرسه او البيت اثناء الواجب و دايما فيه اعذار علشان يقف",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B3.1  "
    '\n'
    "هل تشعر في كثير من الأحيان بالتململ؟ وكيف كان ذلك خلال الطفوله؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "عندك شعور تهيج و عندك شعور باستمرار انك مفروض تعمل حاجه و في توتر و صعوبه في الاسترخاء و الهدوء",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "B3.2"
    '\n'
    " أمثلة خلال مرحلة الطفولة:  "
    '\n'
    " دايما كنت بتجري و كنت بتتسلق علي اثاث البيت "
    '\n'
    "شعور دايم بعدم الارتياح",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  list.add(Question(
    " B4.1  "
    '\n'
    "هل تجد صعوبة في أن تكون هادئ أثناء المشاركة في الأنشطة الترفيهية؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "صعوبة التحدث و القيام بالأنشطه بهدوء"
    '\n'
    "التحدث بصوت عالي لما يكون ده مش مناسب",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "B4.2  "
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "التحدث بصوت مرتفع أثناء اللعب أو في الفصول الدراسيه"
    '\n'
    "غير قادر على مشاهدة التلفزيون أو الفيلم بهدوء",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B5.1  "
    "هل انت غالباً دايم التنقل و تتصرف كأن بيقودك محرك و كيف كان ذلك خلال مرحلة الطفوله"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "مشغول دايماً بحاجه و عندك طاقه كبيره بتخليك بتتحرك علي طول "
    '\n'
    "عندك صعوبه ف انك تسيب موضوع او تسكت مندفع بشكل مفرط",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B5.2 "
    '\n'
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "مشغول دايماً"
    '\n'
    "كنت نشط بشكل مفرط في المدرسه و البيت"
    '\n'
    "كان عندك طاقه كبيره"
    '\n'
    "دائم التنقل , مدفع بشكل مفرط",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "B6.1"
    '\n'
    "هل تتحدث كثيرا بشكل مفرط؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "المعروف انك تتكلم بشكل متواصل"
    '\n'
    "ميال للتكلم اكتر"
    '\n'
    "مبيديش فرصه ان حد تاني يتكلم ف النقاش"
    '\n'
    "بيقول كلمات كتير علشان يعبر عن حاجه",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "B6.2  "
    '\n'
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "كنت معروف باسم ثرثار"
    '\n'
    "كان بيطلب منك كتير انك تبقا هادي"
    '\n'
    "التقارير اللي كانت بتيجي من المدرسه عن كتر الكلام"
    '\n'
    "كنت بتتعاقب كتير بسبب كثرة الكلام"
    '\n'
    "مكنتش بتدي لحد فرصه انو يتكلم اثناء المحادثه  ",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B7.1  "
    '\n'
    "هل تعطي الإجابة في كثير من الأحيان قبل اكتمال الأسئلة؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "بتقول الحاجه من غير تفكيراولاً"
    '\n'
    "بتقول اجابات قبل ما الكلام يخلص"
    '\n'
    "مبتديش مساحه لحد يتكلم"
    '\n'
    "غير لبق",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "B7.2 "
    '\n'
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "كنت بتقول حاجات من غير تقكير بتسرع"
    '\n'
    "عايز تبقا اول حد بيجاوب الأسئله في المدرسه بتسرع"
    '\n'
    "بتقول الحاجه حتي لو عارف انها غلط بتسرع"
    '\n'
    "بتقاطع الأخرين في كلامهم",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B8.1  "
    '\n'
    "هل تجد صعوبة في انتظار دورك؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "صعوبة الانتظار في الطابور أو وضعه بقائمة الانتظار"
    '\n'
    "صعوبة الانتظار بصبر في المرور"
    '\n'
    "صعوبة انتظار دورك أثناء المحادثات"
    '\n'
    "تبدأ بسرعه عقلاقاتك ومهام وظيفتك، أو تنهيها أو تتركها بسبب نفاد الصبر",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    "  B8.2 "
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "صعوبة انتظار دورك في الأنشطه الجماعيه"
    '\n'
    "كان عندك مشكله في انتظار دورك في الفصل"
    '\n'
    "دائما أول من يتحدث أول  من يتصرف"
    '\n'
    "بتعدي الطريق دون النظر او الانتباه"
    '\n'
    "صبرك بينفد بسرعه",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B9.1  "
    '\n'
    "هل تقاطع أنشطة الآخرين في كثير من الأحيان أو تتطفل على الآخرين؟ وكيف كان ذلك خلال الطفولة؟"
    '\n'
    "أمثلة خلال مرحلة البلوغ:"
    '\n'
    "تجري بسرعه للتدخل مع لآخرين"
    '\n'
    "تقاطع  الآخرين"
    '\n'
    " تزعج أنشطة الآخرين دون أن يطلب منك ذلك "
    '\n'
    "تعليقات من الآخرين حول التدخل"
    '\n'
    "صعوبه في احترام حدود الآخرين"
    '\n'
    "وجود رأي حول كل شيء والتعبير عن هذا فورا",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));
  list.add(Question(
    " B9.2  "
    '\n'
    "أمثلة خلال مرحلة الطفولة:"
    '\n'
    "الاعتداء على ألعاب الآخرين"
    '\n'
    "كنت تقاطع محادثات الآخرين "
    '\n'
    " يتفاعل مع كل شيء"
    '\n'
    "غير قادر على الانتظار",
    [
      Answer("نعم", 1),
      Answer(" لا", 0),
    ],
  ));

  return list;
}
