import 'package:flutter/material.dart';

class AAdvice extends StatelessWidget {
  const AAdvice({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("A Advice"),
        centerTitle: true,
        backgroundColor: const Color(0xff6A74D5),
      ),
      body: const SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(12.0),
          child: Text(
            " المشكله هنا هي كسر القواعد  يمكن أن تساعد الأطفال المصابين باضطراب فرط الحركة ونقص الانتباه على اتباع القواعد بشكل أكثر اتساقًا:"
            "فهم التحديات ومعالجتها:"
            '\n'
            "تحديد المحفزات: لاحظ الأوقات التي يكون فيها خرق القواعد أكثر شيوعًا واطرح أفكارًا حول طرق لتقليل تلك المحفزات. على سبيل المثال، إذا كانت التحولات صعبة، فقدم تحذيرات واضحة وإشارات مرئية للتغييرات القادمة."
            '\n'
            "اكتشف الأسباب الأساسية: فكر فيما إذا كان انتهاك القواعد ينبع من الملل أو الإحباط أو سوء الفهم أو الاندفاع. ومعالجة هذه الأسباب الجذرية يمكن أن تؤدي إلى حلول أكثر فعالية."
            '\n'
            "التعزيز والتعاون الإيجابي:"
            '\n'
            "امتدح الخيارات الجيدة: اجعل طفلك يتبع القواعد وقدم له ثناءً محددًا وحقيقيًا. وهذا يعزز السلوك الإيجابي ويبني احترام الذات."
            '\n'
            'أنظمة المكافآت: قم بإنشاء نظام نقطة أو رمز مميز حيث يكسب الأطفال مكافآت مقابل اتباع القواعد باستمرار. حدد المكافآت التي يجدونها محفزة وذات مغزى.'
            '\n'
            'إشراك الأطفال في وضع القواعد: ادعهم للمشاركة في وضع القواعد والعواقب، وتعزيز الشعور بالملكية والمشاركة.'
            '\n'
            'توقعات وهيكل واضح:'
            '\n'
            'قواعد بسيطة ومتسقة: حافظ على القواعد واضحة وموجزة ومتسقة. ركز على عدد قليل من العناصر الأساسية بدلاً من إغراق الأطفال بالكثير منها.'
            '\n'
            'التذكيرات المرئية: استخدم الإشارات المرئية مثل الرسوم البيانية أو قوائم المراجعة أو الموقتات لمساعدة الأطفال على تذكر التوقعات.'
            '\n'
            'البنية والروتين: إنشاء إجراءات يمكن التنبؤ بها للمهام اليومية والواجبات المنزلية ووقت النوم. وهذا يساعد الأطفال الذين يعانون من اضطراب فرط الحركة ونقص الانتباه على البقاء منظمين وتوقع التحولات.'
            '\n'
            'الفهم والدعم:'
            '\n'
            'التعاطف والصبر: تذكر أن اضطراب فرط الحركة ونقص الانتباه يمكن أن يزيد من صعوبة التحكم في الدوافع واتباع القواعد. تعامل مع التحديات بالفهم، وليس باللوم.'
            '\n'
            'التواصل الواضح: اشرح التوقعات بطريقة هادئة وإيجابية. تقديم التذكيرات وإعادة التوجيه حسب الحاجة.'
            '\n'
            'حل المشكلات معًا: بدلًا من فرض العقوبات، اعمل مع الأطفال على تبادل الأفكار للحلول وممارسة الاستراتيجيات لاتباع القواعد.,'
            '\n'
            " اشتغل مع طفلك واستكشف أساليب مختلفة واحتفل بالنجاحات على طول الطريق!",
            textAlign: TextAlign.right,
            style: TextStyle(fontSize: 18),
          ),
        ),
      ),
    );
  }
}
