import 'package:flutter/material.dart';

class BAdvice extends StatelessWidget {
  const BAdvice({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("B Advice"),
        centerTitle: true,
        backgroundColor: const Color(0xff6A74D5),
      ),
      body: const SingleChildScrollView(
        child: Padding(
          padding: EdgeInsets.all(12.0),
          child: Text(
            " الصعوبات التييواجهها في التركيز تعني أنها من المرجح أن تجد المهام الطويلة صعبة بشكل خاص .      قد يكون من المفيد تقسيم المهام إلى وحدات أصغر وأقل تعقيدًا، وتقديم التشجيع عند اكتمال كل مرحلة."
            '\n'
            " - من المرجح أن ينجذب انتباهI إلى المعلومات الجديدة والمثيرة للاهتمام. وبالتالي فإن أي جهود لتقديم الأنشطة على أنها ممتعة ومحفزة ستكون مفيدة لتحسين انتباهه وتحفيزه بشكل عام. قد يكون تقديم المعلومات بتنسيقات جديدة ومتعددة الوسائط مع العديد من الإشارات المرئية مفيدًا بشكل خاص في تحقيق هذا الهدف. إن زيادة مستوى الجدة والاهتمام بالمهمة من خلال زيادة التحفيز (على سبيل المثال، مثل استخدام الأنشطة العملية، والطرائق الحسية، وأجهزة الكمبيوتر وما إلى ذلك)، قد يقلل أيضًا من السلوك التخريبي ويسهل السلوك والتحفيز أثناء المهمة."
            '\n'
            "من المستحسن جدولة مهام أكثر صعوبة في بداية اليوم حيث يمكن توقع انخفاض التحكم في الانتباه والتثبيط السلوكي مع تقدم اليوم."
            '\n'
            "- قد يواجه صعوبة في اتباع التعليمات الطويلة أو المعقدة. ينبغي إعطاء التعليمات بشكل أقصر حيثما أمكن، ويوصى أيضًا بإعطاء التعليمات لمهمة واحدة في كل مرة، بدلاً من إعطاء مهام متعددة."
            '\n'
            "لقد وجدت الأبحاث أنه كلما طالت مدة المهمة دون فترات راحة، زادت المشكلات التي يواجهها الأطفال المصابون باضطراب فرط الحركة ونقص الانتباه مقارنة بأقرانهم غير المصابين باضطراب فرط الحركة ونقص الانتباه. من المرجح أن يكون تقسيم المهام الطويلة إلى أجزاء أصغر يمكن التحكم فيها مفيدًا. يجب أن يتوافق طول أي مهام أكاديمية مع مدى انتباه الطفل؛ وكقاعدة عامة، يقترح أن مقدار العمل الممنوح للشاب المصاب باضطراب فرط الحركة ونقص الانتباه هو نفس مقدار العمل الذي يقوم به طفل أصغر منه بنسبة 30٪."
            "   الاستراتيجيات التنظيمية للأطفال في سن المدرسة المصابين باضطراب فرط الحركة ونقص الانتباه"
            "فيما يلي بعض النصائح لمساعدة الطلاب المصابين باضطراب فرط الحركة ونقص الانتباه على تطوير عادات تنظيمية جيدة:"
            "اعمل مع طفلك على إنشاء منطقة مخصصة للدراسة في المنزل تكون خالية من التشتيت. يجب أن تظل مساحة العمل هذه منظمة بشكل جيد. ساعد طفلك على القيام بذلك من خلال توجيهه عبر الخطوات اللازمة للحفاظ على المنطقة نظيفة وخالية من العناصر غير الضرورية. اعلم أنك ستحتاج إلى الإشراف على طفلك ومساعدته خلال هذه العملية بشكل منتظم. اجعل هذا جزءًا من روتينك اليومي."
            '\n'
            "قم بتوفير مستلزمات مفيدة، مثل أقلام الرصاص، وأقلام الرصاص، والورق، والمسطرة، ومشابك الورق، ومبراة الأقلام، والقاموس، والآلة الحاسبة، وما إلى ذلك. قم بتسمية الأدراج في مكتب أو طاولة منطقة الدراسة وساعد طفلك على وضع اللوازم في الدرج المخصص."
            '\n'
            "اعمل مع معلم طفلك لإعداد نظام لتدوين الواجبات في دفتر الملاحظات. ستنتقل هذه الوثائق ذهابًا وإيابًا من المدرسة إلى المنزل مع طفلك. يجب أن يتضمن دفتر/مجلد المهمة هذا تقويمًا أو مخططًا يمكن استخدامه لتتبع تواريخ استحقاق المشاريع طويلة المدى وتواريخ الاختبار. قم بمراجعة هذا التقويم بانتظام مع طفلك. استخدم التقويم لمساعدة طفلك على تقسيم المشاريع الأطول إلى أجزاء أصغر. ضع في اعتبارك أنك قد تحتاج إلى أن تكون مبدعًا مع طفلك لمساعدته في العثور على نظام ناجح."
            '\n'
            "اطلب من المعلم تقديم الدعم عن طريق تذكير طفلك بلطف عندما يحين وقت كتابة المهام في دفتر ملاحظات. تضمن هذه الخطوة فهمهم للواجبات والتحقق من أن الواجبات مكتوبة بشكل صحيح في دفتر الملاحظات. في نهاية اليوم الدراسي، من المفيد أيضًا أن يتحقق المعلم من أن الكتب والأوراق ودفتر الواجبات المنزلية المناسبة يمكن وضعها في حقيبة كتب طفلك."
            '\n'
            "إذا كان طفلك يعاني من صعوبة في الكتابة اليدوية، فاطلب من المعلم إعطاء طفلك نشرة مطبوعة من الواجبات اليومية التي يمكن تضمينها في دفتر الواجبات المنزلية. والأفضل من ذلك أن يتمكن المعلم من تقديم النشرات التي تحتوي على ثلاثة ثقوب مسبقًا ويمكن وضع النشرات مباشرة في دفتر الواجبات المنزلية."
            '\n'
            'في نهاية وقت الواجب المنزلي قبل اليوم الدراسي التالي، قم بمراجعة أوراق الواجب المنزلي والكتب التي يجب إرجاعها إلى حقيبة الكتب الخاصة بهم للمدرسة. راقب طفلك أثناء قيامه بجمع هذه العناصر داخل حقيبة الكتب ووضعها في مكان مخصص بالقرب من باب المنزل. بهذه الطريقة يمكن بسهولة العثور على حقيبة الكتب في الصباح.'
            '\n'
            "اسأل المعلم عن جدولة أوقات منتظمة لطفلك لتنظيم وتنظيف مكتبه وخزانته في المدرسة. تأكد من تحديد أوقات منتظمة لطفلك لتنظيف حقيبة الظهر المدرسية والدفاتر في المنزل أيضًا. افهم أن طفلك سيحتاج إلى الإشراف والمساعدة في هذه الأعمال. يعد توجيه طفلك خلال هذه الخطوات وممارسة هذه المهارات مرارًا وتكرارًا أمرًا ضروريًا لتكوين عادات جيدة."
            '\n'
            'تخصيص مناطق من المكتب أو الخزانة لعناصر محددة. يمكنك أيضًا "رسم" هذه المناطق بشريط لاصق للإشارة إلى المكان الذي يجب أن تذهب إليه العناصر - على سبيل المثال، دفاتر الملاحظات والكتب والمجلدات وأدوات الكتابة وما إلى ذلك. وهذا سيجعل من السهل وضع العناصر مرة أخرى في المكان الصحيح حتى يمكن العثور عليها عند الاحتياج.'
            '\n'
            'قم بشراء مجموعة من أغلفة الكتب والدفاتر والمجلدات المرمزة بالألوان لكل موضوع. يمكن لطفلك تنظيم عمله حسب الألوان. على سبيل المثال، قد يختارون اللون الأحمر للرياضيات، والأصفر لفنون اللغة، والأخضر للعلوم، وما إلى ذلك. شارك مع المعلم حتى يتمكن من دعم طفلك في استخدام هذا النظام أيضًا. يمكن للمدرس أيضًا تمييز النشرات الخاصة بكل موضوع باستخدام اللون المقابل في مكان ما على الصفحة.'
            '\n'
            'قم بإعداد نظام مكافآت محفز لتعزيز طفلك بشكل إيجابي حيث يظهر تحسينات في تطوير المزيد والمزيد من المهارات التنظيمية في حياته اليومية.'
            '\n'
            ' بالنسبة للأطفال الذين يعانون من صعوبات في الانتباه، يمكن أن يكون استخدام أجهزة ضبط الوقت مفيدًا جدًا لدعم إكمال المهام. يمكن إعداد مؤقت  بعد فترات زمنية قصيرة (الفترة المقدرة التي سيستغرقها إكمال مهمة قصيرة) وإذا تمكن من التركيز بنجاح، فيمكن زيادة هذه الفترات.'
            '\n'
            '- نظرًا للصعوبات التي يواجهها  " اسم  " فيما يتعلق بعدم الانتباه، فإن أي مديح يتم تقديمه يجب أن يكون فوريًا ومحددًا. استجابت بشكل جيد لاستخدام الملصقات كمكافأة لها على جهودها خلال التقييم الحالي. من المحتمل أن تستفيد من الجهود المبذولة لإظهار إنجازاتها بشكل ملموس (مثل الملصقات والشهادات) بالإضافة إلى الثناء اللفظي، بالإضافة إلى الجهود المبذولة لدعمها في مدح نفسها (على سبيل المثال، التعليق "،مفروض  تكون فخور بنفسك " ").',
            textAlign: TextAlign.right,
            style: TextStyle(fontSize: 18),
          ),
        ),
      ),
    );
  }
}
